sehodges/jacdac-stm32g0/src/jdsimple.h
#ifndef __JDSIMPLE_H
#define __JDSIMPLE_H

#include <stdint.h>
#include <string.h>
#include <stdbool.h>

#if defined(STM32F0)
#include "stm32f0.h"
#elif defined(STM32G0)
#include "stm32g0.h"
#else
#error "invalid CPU"
#endif

#include "board.h"
#include "dmesg.h"
#include "pinnames.h"
#include "jdlow.h"
#include "services.h"
#include "host.h"

#ifdef __cplusplus
extern "C" {
#endif

#define RAM_FUNC __attribute__((noinline, long_call, section(".data")))

// main.c
void led_toggle(void);
void led_set(int state);
void led_blink(int us);

// utils.c
int itoa(int n, char *s);
int string_reverse(char *s);
uint64_t device_id(void);
RAM_FUNC
void target_wait_cycles(int n);

// exti.c
void exti_set_callback(GPIO_TypeDef *port, uint32_t pin, cb_t callback);
void exti_trigger(cb_t cb);
#define exti_disable(pin) LL_EXTI_DisableIT_0_31(pin)
#define exti_enable(pin) LL_EXTI_EnableIT_0_31(pin)
#define exti_enable(pin) LL_EXTI_EnableIT_0_31(pin)
#define exti_clear(pin) LL_EXTI_ClearFallingFlag_0_31(pin)

// dspi.c
void dspi_init(void);
void dspi_tx(const void *data, uint32_t numbytes, cb_t doneHandler);

void px_init(void);
void px_tx(const void *data, uint32_t numbytes, cb_t doneHandler);
void px_set(const void *data, uint32_t index, uint32_t color);
#define PX_WORDS(NUM_PIXELS) (((NUM_PIXELS) * 9 + 8) / 4)

// pins.c
void pin_set(int pin, int v);
void pin_setup_output(int pin);
void pin_toggle(int pin);
int pin_get(int pin);
// pull: -1, 0, 1
void pin_setup_input(int pin, int pull);
void pin_setup_output_af(int pin, int af);

// adc.c
void adc_init_random(void);

// pwm.c
uint8_t pwm_init(uint8_t pin, uint32_t period, uint32_t duty);
void pwm_set_duty(uint8_t pwm_id, uint32_t duty);

// jdapp.c
void app_process(void);
void app_init_services(void);

// txq.c
void txq_flush(void);
int txq_is_idle(void);
void *txq_push(unsigned service_num, unsigned service_cmd, unsigned service_arg, const void *data,
               unsigned service_size);

// alloc.c
void alloc_init(void);
void *alloc(uint32_t size);

extern uint32_t now;

// check if given timestamp is already in the past, regardless of overflows on 'now'
// the moment has to be no more than ~500 seconds in the past
static inline bool in_past(uint32_t moment) {
    return ((now - moment) >> 29) == 0;
}
static inline bool in_future(uint32_t moment) {
    return !in_past(moment);
}


#ifdef __cplusplus
}
#endif

#endif
